---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Railing.TopRail
zh: 栏杆
source: html/2cde1842-b57b-6864-2f4a-c4852303a152.htm
---
# Autodesk.Revit.DB.Architecture.Railing.TopRail Property

**中文**: 栏杆

The top rail of the railing.

## Syntax (C#)
```csharp
public ElementId TopRail { get; }
```